stubs/__files/partner/psl/read_equipment_49_30_1000_76H1.xml

<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<SOAP:Envelope xmlns:SOAP='http://schemas.xmlsoap.org/soap/envelope/'>
    <SOAP:Header/>
    <SOAP:Body>
        <ns1:MT_EQDATA_RESPV2 xmlns:ns1='http://telekom.de/xi/NGERP_EXTD_PSL_INT/global/WMS/Equipment/Read/V2'>
            <eiMessageContext>
                <target xmlns='http://messaging.ei.tmobile.net/datatypes'>SI_ReadEquipmentResponseV2In_DigiOSS</target>
                <requestId xmlns='http://messaging.ei.tmobile.net/datatypes'>urn:uuid:7305493d-d1fd-4e2f-8024-cbba99c9226e</requestId>
                <timeLeft xmlns='http://messaging.ei.tmobile.net/datatypes'>172800000</timeLeft>
                <priority xmlns='http://messaging.ei.tmobile.net/datatypes'>4</priority>
                <sender xmlns='http://messaging.ei.tmobile.net/datatypes'>sndr:tmo.erp.sap.architecture.SAP:PI</sender>
                <correlationId xmlns='http://messaging.ei.tmobile.net/datatypes'>e7b1abea-1d00-4945-ac1c-10cf1f403121</correlationId>
            </eiMessageContext>
            <data>
                <MT_EQDATA_RESPV2>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212879995</HEQUI>
                        <HEQNR>0056</HEQNR>
                        <ASB>1</ASB>
                        <TPLNR>000031-000000-001-004-002-021</TPLNR>
                        <EQART>G</EQART>
                        <ANZ_EBENEN>1</ANZ_EBENEN>
                        <EQUNR>212880011</EQUNR>
                        <SERGE>21023533106TG4900198</SERGE>
                        <SUBMT>40247069</SUBMT>
                        <ADR_ID>17056514</ADR_ID>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0001</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880063</EQUNR>
                        <SERGE>021BQWW0G6002494</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0002</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880056</EQUNR>
                        <SERGE>020KAX6TG5602889</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>003</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880057</EQUNR>
                        <SERGE>020KAX6TG5604051</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>004</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880062</EQUNR>
                        <SERGE>020KKPCNG5010973</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>005</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880059</EQUNR>
                        <SERGE>020NDECNG5030513</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>006</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>007</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>008</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40294954</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>009</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40247071</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0010</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40247071</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0011</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40251139</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0012</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40261742</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0019</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40247074</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0020</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40247074</SUBMT>
                    </EQUI>
                    <EQUI>
                        <ENDSZ>49/30/1000/76H1</ENDSZ>
                        <HEQUI>212880011</HEQUI>
                        <HEQNR>0021</HEQNR>
                        <EQART>P</EQART>
                        <ANZ_EBENEN>2</ANZ_EBENEN>
                        <EQUNR>212880061</EQUNR>
                        <SERGE>020NDECNG5029943</SERGE>
                        <SUBMT>40247072</SUBMT>
                    </EQUI>
                    <KOPF>
                        <PARTNER>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/PARTNER/text()'}}</PARTNER>
                        <ANFO_KEN>{{xPath request.body '//data/MT_EQDATA_REQ/KOPF/ANFO_KEN/text()'}}</ANFO_KEN>
                    </KOPF>
                    <STATUS>
                        <LOG_NO>0000000000</LOG_NO>
                        <NUMBER>000</NUMBER>
                        <SYSTEM>Linux</SYSTEM>
                        <LOG_NO>string</LOG_NO>
                        <ID>ZDIB</ID>
                        <MESSAGE>Die Anforderung wurde ausgeführt.</MESSAGE>
                        <TYPE>S</TYPE>
                    </STATUS>
                </MT_EQDATA_RESPV2>
            </data>
        </ns1:MT_EQDATA_RESPV2>
    </SOAP:Body>
</SOAP:Envelope>